src/cf/Enums/ВидыПочтовыхКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыПочтовыхКлиентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>MozillaThunderbird</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>MSOutlook</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TheBat</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнтернетПочта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Почта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ТипыТекстовПочтовыхСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыТекстовПочтовыхСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>HTML</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПростойТекст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазмеченныйТекст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольныйТекст</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВажностьПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВажностьПисем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Высокая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обычная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Низкая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/ЛегкаяПочтаКлиент/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Легкая почта (клиент)
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Отправляет сообщение
//
// Параметры:
// - Сообщение (Структура)
//
Процедура Отправить(ОписаниеОповещения, ПараметрыОтправки) Экспорт
	
	УникальныйИдентификатор = Новый УникальныйИдентификатор;
	Сообщение = ПараметрыОтправкиПочтовогоСообщенияВызовСервера.СформироватьСтруктуруПочтовогоСообщения(
		ПараметрыОтправки,
		УникальныйИдентификатор);
	Если ПараметрыОтправки.Шифровать Тогда
		ПараметрыОтправкиПочтовогоСообщенияКлиент.ЗашифроватьВложения(ПараметрыОтправки, Сообщение, УникальныйИдентификатор,
			ОписаниеОповещения);
		Возврат;
	КонецЕсли;
	
	ОтправитьПослеШифрования(ОписаниеОповещения, ПараметрыОтправки, Сообщение);
	
КонецПроцедуры

// Продолжение отправки
Процедура ОтправитьПослеШифрования(ОписаниеОповещения, ПараметрыОтправки, Сообщение) Экспорт
	
	ПараметрыОбработчика = Новый Структура;
	ПараметрыОбработчика.Вставить("ОписаниеОповещения", ОписаниеОповещения);
	ПараметрыОбработчика.Вставить("ПараметрыОтправки", ПараметрыОтправки);
	ПараметрыОбработчика.Вставить("Сообщение", Сообщение);
	ОписаниеОповещенияФормы = Новый ОписаниеОповещения(
		"ОтправитьПродолжение",
		ЭтотОбъект,
		ПараметрыОбработчика);
	
	КодВозврата = Ложь;
	ВидПочтовогоКлиента = ПараметрыОтправкиПочтовогоСообщения.ПолучитьВидПочтовогоКлиента(ПараметрыОтправки);
	Если ВидПочтовогоКлиента = ПредопределенноеЗначение("Перечисление.ВидыПочтовыхКлиентов.ИнтернетПочта") Тогда
		Пароль = ПараметрыОтправкиПочтовогоСообщения.ПолучитьПароль(ОписаниеОповещенияФормы.ДополнительныеПараметры.ПараметрыОтправки);
		Если ПустаяСтрока(Пароль) И Не ПараметрыОтправки.ПарольНеТребуется Тогда
			ОткрытьФорму(
				"ОбщаяФорма.ВводПароляУчетнойЗаписиПочты",,,,,,
				ОписаниеОповещенияФормы,
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			Возврат;
		КонецЕсли;
		ВыполнитьОбработкуОповещения(ОписаниеОповещенияФормы, Пароль);
		Возврат;
		
	ИначеЕсли ВидПочтовогоКлиента = ПредопределенноеЗначение("Перечисление.ВидыПочтовыхКлиентов.Почта") Тогда
		
		Если ОбщегоНазначенияКлиент.ЭтоWindowsКлиент() Тогда
			ПрофильИнфо = ПараметрыОтправкиПочтовогоСообщения.ПолучитьСтруктуруПрофиля(ПараметрыОтправки);
			КодВозврата = ЛегкаяПочтаКлиентWindows.ОтправитьПочта(Сообщение, ПрофильИнфо);
		КонецЕсли;
		
	ИначеЕсли ВидПочтовогоКлиента = ПредопределенноеЗначение("Перечисление.ВидыПочтовыхКлиентов.MSOutlook") Тогда
		КодВозврата = ЛегкаяПочтаКлиент.ОткрытьФормуСообщенияMSOutlook(Сообщение);
		
	ИначеЕсли ВидПочтовогоКлиента = ПредопределенноеЗначение("Перечисление.ВидыПочтовыхКлиентов.TheBat") Тогда
		ПрофильИнфо = ПараметрыОтправкиПочтовогоСообщения.ПолучитьСтруктуруПрофиля(ПараметрыОтправки);
		КодВозврата = ЛегкаяПочтаКлиент.ОткрытьФормуСообщенияTheBat(
			Сообщение,
			ПрофильИнфо);
		
	ИначеЕсли ВидПочтовогоКлиента = ПредопределенноеЗначение("Перечисление.ВидыПочтовыхКлиентов.MozillaThunderbird") Тогда
		ПрофильИнфо = ПараметрыОтправкиПочтовогоСообщения.ПолучитьСтруктуруПрофиля(ПараметрыОтправки);
		КодВозврата = ЛегкаяПочтаКлиент.ОткрытьФормуСообщенияMozillaThunderbird(
			Сообщение,
			ПрофильИнфо);
		
	Иначе
		ВызватьИсключение НСтр("ru = 'Некорректный вид почтового клиента'");
	КонецЕсли;
	
	ПараметрыВозврата = Новый Структура;
	ПараметрыВозврата.Вставить("КодВозврата", КодВозврата);
	ПараметрыВозврата.Вставить("СообщениеОбОшибке", "");
	ВыполнитьОбработкуОповещения(ОписаниеОповещения, ПараметрыВозврата);
	
КонецПроцедуры

// Продолжение отправки
Процедура ОтправитьПродолжение(Пароль, Параметры) Экспорт
	
	Если Не Параметры.ПараметрыОтправки.ПарольНеТребуется 
		И (ТипЗнч(Пароль) <> Тип("Строка") Или ПустаяСтрока(Пароль)) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Параметры.ПараметрыОтправки.ПарольНеТребуется Тогда
		ПараметрыОтправкиПочтовогоСообщения.УстановитьПароль(Параметры.ПараметрыОтправки, Пароль);
	КонецЕсли;
	
	Пароль = "";
	Если Не Параметры.ПараметрыОтправки.ПарольНеТребуется Тогда
		Пароль = ПараметрыОтправкиПочтовогоСообщения.ПолучитьПароль(Параметры.ПараметрыОтправки);
		Если Не ЗначениеЗаполнено(Пароль) Тогда
			Пароль = Неопределено;
		КонецЕсли;
	КонецЕсли;
	УчетнаяЗапись = ПараметрыОтправкиПочтовогоСообщения.ПолучитьПрофиль(Параметры.ПараметрыОтправки);
	СообщениеОбОшибке = "";
	КодВозврата = ЛегкаяПочтаСервер.ОтправитьИнтернетПочта(
		Параметры.Сообщение,
		УчетнаяЗапись,
		Пароль,
		СообщениеОбОшибке);
	ПараметрыВозврата = Новый Структура;
	ПараметрыВозврата.Вставить("КодВозврата", КодВозврата);
	ПараметрыВозврата.Вставить("СообщениеОбОшибке", СообщениеОбОшибке);
	ВыполнитьОбработкуОповещения(Параметры.ОписаниеОповещения, ПараметрыВозврата);
	
КонецПроцедуры

// Загружает сообщения, используя почтового клиента, указанного в настройках загрузки
//
// Параметры:
// - НастройкаЗагрузкиЭлектроннойПочты (Структура)
//
Процедура Получить(ПараметрыЗагрузки, ОписаниеОповещения) Экспорт
	
	ВидПочтовогоКлиента = ПараметрыЗагрузки.НастройкиПрофилейДляЗагрузки.Профиль.ВидПочтовогоКлиента;
	Если ВидПочтовогоКлиента = ПредопределенноеЗначение("Перечисление.ВидыПочтовыхКлиентов.ИнтернетПочта") Тогда
		
		ПараметрыОбработчика = Новый Структура;
		ПараметрыОбработчика.Вставить("ПараметрыЗагрузки", ПараметрыЗагрузки);
		ПараметрыОбработчика.Вставить("ОписаниеОповещения", ОписаниеОповещения);
		
		ОписаниеОповещенияФормы = Новый ОписаниеОповещения(
			"ПолучитьПродолжение",
			ЭтотОбъект,
			ПараметрыОбработчика);
			
		Пароль = ПараметрыЗагрузки.НастройкиПрофилейДляЗагрузки.Профиль.Пароль;	
		Если ПустаяСтрока(Пароль) И Не ПараметрыЗагрузки.ПарольНеТребуется Тогда
			ОткрытьФорму(
				"ОбщаяФорма.ВводПароляУчетнойЗаписиПочты",,,,,,
				ОписаниеОповещения,
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			Возврат;
		КонецЕсли;
		Результат = ЛегкаяПочтаСервер.ПолучитьИнтернетПочта(ПараметрыЗагрузки);
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, Результат);
		Возврат;
	ИначеЕсли ВидПочтовогоКлиента = ПредопределенноеЗначение("Перечисление.ВидыПочтовыхКлиентов.Почта") Тогда
		
		Если ОбщегоНазначенияКлиент.ЭтоWindowsКлиент() Тогда
			Результат = ЛегкаяПочтаКлиентWindows.ПолучитьПочта(ПараметрыЗагрузки);
		КонецЕсли;
		
	ИначеЕсли ВидПочтовогоКлиента = ПредопределенноеЗначение("Перечисление.ВидыПочтовыхКлиентов.MSOutlook") Тогда
		Результат = ЛегкаяПочтаКлиент.ПолучитьMSOutlook(ПараметрыЗагрузки);
	Иначе
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, Неопределено);
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Результат) <> Тип("Массив") Тогда
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, Неопределено);
		Возврат;
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ОписаниеОповещения, Результат);
	
КонецПроцедуры

// Продолжение получения
Процедура ПолучитьПродолжение(Пароль, Параметры) Экспорт
	
	Если ТипЗнч(Пароль) = Тип("Строка") Тогда
		Если Не ПустаяСтрока(Пароль) Тогда
			Параметры.ПараметрыЗагрузки.Вставить("ПарольУчетнойЗаписиПочты", Пароль);
			Результат = ЛегкаяПочтаСервер.ПолучитьИнтернетПочта(Параметры.ПараметрыЗагрузки);
			ВыполнитьОбработкуОповещения(Параметры.ОписаниеОповещения, Результат);
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

// Открывает форму сообщения внутри почтового клиента TheBat!
//
// Параметры:
// - Сообщение (Структура)
//
Функция ОткрытьФормуСообщенияTheBat(Сообщение, СтруктураПрофиля) Экспорт
	
	ПараметрыПодключения = СтруктураПрофиля.Данные;
	
	ПараметрыКоманднойСтроки = Новый Структура;
	ПараметрыКоманднойСтроки.Вставить("PATH", ПараметрыПодключения.PATH);
	ПараметрыКоманднойСтроки.Вставить("USER", ПараметрыПодключения.USER);
	ПараметрыКоманднойСтроки.Вставить("PASSWORD", ПараметрыПодключения.PASSWORD);
	ПараметрыКоманднойСтроки.Вставить("SUBJECT", Сообщение.Тема);
	
	Шаблон = "";
	Для каждого Получатель Из Сообщение.Получатели Цикл
		ДобавитьЗначениеКСтрокеЧерезРазделитель(Шаблон, Символы.ПС, "%TO=""" + Получатель + """");
	КонецЦикла;
	Для каждого Получатель Из Сообщение.Копии Цикл
		ДобавитьЗначениеКСтрокеЧерезРазделитель(Шаблон, Символы.ПС, "%CC=""" + Получатель + """");
	КонецЦикла;
	Для каждого Получатель Из Сообщение.СлепыеКопии Цикл
		ДобавитьЗначениеКСтрокеЧерезРазделитель(Шаблон, Символы.ПС, "%BCC=""" + Получатель + """");
	КонецЦикла;
	
	Если Сообщение.Важность = 2 Тогда
		ДобавитьЗначениеКСтрокеЧерезРазделитель(Шаблон, Символы.ПС, "%PRIORITY=""H""");
	КонецЕсли;
	
	ДобавитьЗначениеКСтрокеЧерезРазделитель(Сообщение.Текст, Символы.ПС, Шаблон);
	
	АдресФайлаСодержания = ПоместитьСодержаниеВоВременныйФайл(Сообщение);
	Если ПустаяСтрока(АдресФайлаСодержания) Тогда
		Возврат Ложь;
	КонецЕсли;
	ПараметрыКоманднойСтроки.Вставить("TEXT", АдресФайлаСодержания);
	
	ВременныйКаталог = ПоместитьВложенияВоВременныйКаталог(Сообщение);
	Если ПустаяСтрока(ВременныйКаталог) Тогда
		Возврат Ложь;
	КонецЕсли;
	ПараметрыКоманднойСтроки.Вставить("ATTACH", ВременныйКаталог + "\*.*");
	
	КомандаСтр =
	"%PATH%\TheBat.exe /MAIL;
	|USER=""%USER%"";
	|PASSWORD=""%PASSWORD%"";
	|SUBJECT=""%SUBJECT%"";
	|TEMPLATE=""%TEXT%"";
	|ATTACH=""%ATTACH%""";
	
	КомандаСтр = СтрЗаменить(КомандаСтр, "%PATH%", ПараметрыКоманднойСтроки.PATH);
	КомандаСтр = СтрЗаменить(КомандаСтр, "%USER%", ПараметрыКоманднойСтроки.USER);
	КомандаСтр = СтрЗаменить(КомандаСтр, "%PASSWORD%", ПараметрыКоманднойСтроки.PASSWORD);
	КомандаСтр = СтрЗаменить(КомандаСтр, "%SUBJECT%", ПараметрыКоманднойСтроки.SUBJECT);
	КомандаСтр = СтрЗаменить(КомандаСтр, "%TEXT%", ПараметрыКоманднойСтроки.TEXT);
	КомандаСтр = СтрЗаменить(КомандаСтр, "%ATTACH%", ПараметрыКоманднойСтроки.ATTACH);
	КомандаСтр = СтрЗаменить(КомандаСтр, Символы.ПС, "");	
	
	ЗапуститьПриложение(КомандаСтр);
	
	Возврат Истина;
	
КонецФункции

// Открывает форму сообщения внутри почтового клиента Mozilla Thunderbird
//
// Параметры:
// - Сообщение (Структура)
//
Функция ОткрытьФормуСообщенияMozillaThunderbird(Сообщение, СтруктураПрофиля) Экспорт
	
	ПараметрыПодключения = СтруктураПрофиля.Данные;
	ПутьКПриложению = ПараметрыПодключения.PATH;
	
	КомандаСтр = ВКавычках(ПутьКПриложению + "\thunderbird.exe");
	ДобавитьЗначениеКСтрокеЧерезРазделитель(КомандаСтр, " ", "-compose");
	
	Кому = ""; Копии = ""; СкрытыеКопии = "";
	
	Для каждого Получатель Из Сообщение.Получатели Цикл 
		
		ПолучательСтрока = Получатель;
		ПолучательСтрока = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ПолучательСтрока);
		ПолучательСтрока = СтрЗаменить(ПолучательСтрока, ",", " ");
		
		ДобавитьЗначениеКСтрокеЧерезРазделитель(Кому, ",", ПолучательСтрока);
	КонецЦикла;
	
	Для каждого Получатель Из Сообщение.Копии Цикл
		
		ПолучательСтрока = Получатель;
		ПолучательСтрока = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ПолучательСтрока);
		ПолучательСтрока = СтрЗаменить(ПолучательСтрока, ",", " ");
		
		ДобавитьЗначениеКСтрокеЧерезРазделитель(Копии, ",", ПолучательСтрока);
	КонецЦикла;
	
	Для каждого Получатель Из Сообщение.СлепыеКопии Цикл
		
		ПолучательСтрока = Получатель;
		ПолучательСтрока = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ПолучательСтрока);
		ПолучательСтрока = СтрЗаменить(ПолучательСтрока, ",", " ");
		
		ДобавитьЗначениеКСтрокеЧерезРазделитель(СкрытыеКопии, ",", ПолучательСтрока);
	КонецЦикла;  
	
	Параметры = "";
	Если Не ПустаяСтрока(Кому) Тогда
		ДобавитьЗначениеКСтрокеЧерезРазделитель(Параметры, ",", "to='" + Кому + "'");
	КонецЕсли;
	Если Не ПустаяСтрока(Копии) Тогда
		ДобавитьЗначениеКСтрокеЧерезРазделитель(Параметры, ",", "cc='" + Копии + "'");
	КонецЕсли;
	Если Не ПустаяСтрока(СкрытыеКопии) Тогда
		ДобавитьЗначениеКСтрокеЧерезРазделитель(Параметры, ",", "bcc='" + СкрытыеКопии + "'");
	КонецЕсли;
	
	Тема = СтрЗаменить(Сообщение.Тема,"'","");  
	Тема = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(Тема);
	Тема = СтрЗаменить(Тема, ",", " ");
	
	Если Не ПустаяСтрока(Тема) Тогда
		ДобавитьЗначениеКСтрокеЧерезРазделитель(Параметры, ",", "subject='" + Тема+ "'");
	КонецЕсли;
	
	Если Сообщение.Вложения.Количество() > 0 Тогда
		ВременныйКаталог = ПоместитьВложенияВоВременныйКаталог(Сообщение);
		Если ПустаяСтрока(ВременныйКаталог) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Файлы = НайтиФайлы(ВременныйКаталог,"*.*");
		СписокФайлов = "";
		Для каждого Файл Из Файлы Цикл
			ДобавитьЗначениеКСтрокеЧерезРазделитель(СписокФайлов, ",", ВКавычках(Файл.ПолноеИмя));
		КонецЦикла;
		ДобавитьЗначениеКСтрокеЧерезРазделитель(Параметры, ",", "attachment='" + СписокФайлов+ "'");
	КонецЕсли;
	
	Текст = СтрЗаменить(Сообщение.Текст,"'","");
	Текст = СтрЗаменить(Текст,"""","""""");
	Если Не ПустаяСтрока(Текст) Тогда
		ДобавитьЗначениеКСтрокеЧерезРазделитель(Параметры, ",", "body='" + Текст+ "'");
	КонецЕсли;
	
	Если Не ПустаяСтрока(Параметры) Тогда
		ДобавитьЗначениеКСтрокеЧерезРазделитель(КомандаСтр, " ", Параметры);
	КонецЕсли;
	
	ЗапуститьПриложение(КомандаСтр);
	
	Возврат Истина;
	
КонецФункции

// Возвращает папку MSOutlook имеющую переданный путь или Неопределено, если не найдена.
//
Функция ПолучитьПапкуMSOutlook(Знач Путь) Экспорт
	
#Если МобильныйКлиент Тогда
	Возврат Неопределено;
#Иначе
	Попытка
		Application = Новый COMОбъект("Outlook.Application");
		Folder = Application.GetNamespace("MAPI");
		Если Найти(Путь, "\\") = 1 Тогда
			Путь = Сред(Путь, 3);
		КонецЕсли;
		Пока Не ПустаяСтрока(Путь) Цикл
			Поз = Найти(Путь, "\");
			Если Поз = 0 Тогда
				ИмяПапки = Путь;
				Путь = "";
			Иначе
				ИмяПапки = Лев(Путь, Поз - 1);
				Путь = Сред(Путь, Поз + 1);
			КонецЕсли;
			Folder = Folder.Folders.Item(ИмяПапки);
		КонецЦикла;
		Возврат Folder;
	Исключение
		Возврат Неопределено;
	КонецПопытки;
#КонецЕсли
	
КонецФункции

// Получает почтовые сообщения с помощью объекта "Outlook.Application".
// Результат (Массив)
// - Элемент (Структура) - Сообщение
//
// Параметры:
// - НастройкаЗагрузкиЭлектроннойПочты (Структура)
//   - Папка (Строка)
//   - ЗагружатьСДаты (ДатаИВремя)
//   - УникальныйИдентификатор (УникальныйИдентификатор)
//
Функция ПолучитьMSOutlook(ПараметрыЗагрузки) Экспорт
	Перем ПериодЗагрузки;
	
	Результат = Новый Массив;
	
	УникальныйИдентификатор = ПараметрыЗагрузки.УникальныйИдентификатор;
	НепрочитанныеСообщения = ПараметрыЗагрузки.НепрочитанныеСообщения;
	Путь = ПараметрыЗагрузки.НастройкиПрофилейДляЗагрузки.Профиль.Данные.Путь;
	ПериодЗагрузки = "";
	Если ПараметрыЗагрузки.Свойство("ПериодЗагрузки") Тогда
		ПериодЗагрузки = ПараметрыЗагрузки.ПериодЗагрузки;
	КонецЕсли;
	
	Folder = ПолучитьПапкуMSOutlook(Путь);
	Если Folder = Неопределено Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Папка %1 не найдена'"),
			Путь);
	КонецЕсли;
	
	ДатаСтр = "";
	Если Не ПустаяСтрока(ПериодЗагрузки) Тогда
		ДатаСтр = ЛегкаяПочтаКлиентСервер.ПолучитьДатуПоПериодуЗагрузки(ПериодЗагрузки);
	КонецЕсли;
	
	Restrict = "";
	Если Не ПустаяСтрока(ДатаСтр) Тогда
		ДобавитьЗначениеКСтрокеЧерезРазделитель(Restrict, " And ", "[ReceivedTime] > '" + ДатаСтр + "'");
	КонецЕсли;
	Если НепрочитанныеСообщения Тогда
		ДобавитьЗначениеКСтрокеЧерезРазделитель(Restrict, " And ", "[UnRead] = True");
	КонецЕсли;
	Если Не ПустаяСтрока(Restrict) Тогда
		Items = Folder.Items.Restrict(Restrict);
	Иначе
		Items = Folder.Items;
	КонецЕсли;
	
	Для каждого Item Из Items Цикл
		Если Item.Class <> 43 Тогда // OlObjectClass.olMail
			Продолжить;
		КонецЕсли;
		
		СтруктураСообщения = ЛегкаяПочтаКлиентСервер.СформироватьСтруктуруСообщения();
		
		СтруктураСообщения.УникальныйИдентификатор = УникальныйИдентификатор;
		СтруктураСообщения.Тема = РаботаСоСтроками.УдалитьНедопустимыеСимволыXML(Item.Subject);
		СтруктураСообщения.Текст = РаботаСоСтроками.УдалитьНедопустимыеСимволыXML(Item.Body);
		Если Item.BodyFormat = 2 Тогда // OlBodyFormat.olFormatHTML
			СтруктураСообщения.ТипТекста = ПредопределенноеЗначение("Перечисление.ТипыТекстовПочтовыхСообщений.HTML");
			СтруктураСообщения.ТекстHTML = РаботаСоСтроками.УдалитьНедопустимыеСимволыXML(Item.HTMLBody);
			ИдентификаторыКартинокHTML = ПолучитьИдентификаторыКартинок(СтруктураСообщения.ТекстHTML);
		КонецЕсли;
		
		ИмяОтправителя = РаботаСоСтроками.УдалитьНедопустимыеСимволыXML(Item.SenderName);
		АдресЭлектроннойПочтыОтправителя = РаботаСоСтроками.УдалитьНедопустимыеСимволыXML(Item.SenderEmailAddress);
		СтруктураСообщения.Отправитель = РаботаСоСтроками.ПолучитьПредставлениеАдресаЭлектроннойПочты(
			ИмяОтправителя,
			АдресЭлектроннойПочтыОтправителя);
		
		СтруктураСообщения.Кому = СформироватьСтрокуПолучателейMSOutlook(Item.Recipients);
		
		Если Item.Importance = 0 Тогда // OlImportance.olImportanceLow
			СтруктураСообщения.Важность = ПредопределенноеЗначение("Перечисление.ВажностьПисем.Низкая");
		ИначеЕсли Item.Importance = 2 Тогда // OlImportance.olImportanceHigh
			СтруктураСообщения.Важность = ПредопределенноеЗначение("Перечисление.ВажностьПисем.Высокая");
		Иначе
			СтруктураСообщения.Важность = ПредопределенноеЗначение("Перечисление.ВажностьПисем.Обычная");
		КонецЕсли;
		
		СтруктураСообщения.ДатаОтправки = Item.SentOn;
		СтруктураСообщения.ДатаПолучения = Item.ReceivedTime;
		СтруктураСообщения.Идентификатор = Item.EntryID;
		СтруктураСообщения.ОбратныйАдрес = РаботаСоСтроками.УдалитьНедопустимыеСимволыXML(Item.ReplyRecipientNames);
		СтруктураСообщения.Размер = Item.Size;
		//СтруктураСообщения.НеПрочитано = Item.UnRead;
		
		Для каждого Attachment Из Item.Attachments Цикл
			AttachmentType = Attachment.Type;
			Если AttachmentType = 6 Тогда // OlAttachmentType.olOLE
				Продолжить;
			КонецЕсли;
			FileName = РаботаСоСтроками.УдалитьНедопустимыеСимволыXML(Attachment.FileName);
			DisplayName = РаботаСоСтроками.УдалитьНедопустимыеСимволыXML(Attachment.DisplayName);
			
			ПолноеИмяВременногоФайла = ПолучитьПолноеИмяВременногоФайла(FileName);
			Attachment.SaveAsFile(ПолноеИмяВременногоФайла);
			ДвоичныеДанные = Новый ДвоичныеДанные(ПолноеИмяВременногоФайла);
			Наименование = DisplayName;
			ИмяФайла = FileName;
			
			Если СтруктураСообщения.ТипТекста = ПредопределенноеЗначение("Перечисление.ТипыТекстовПочтовыхСообщений.HTML") Тогда
				ИдентификаторКартинки = НайтиИдентификаторКартинки(ИдентификаторыКартинокHTML, ИмяФайла);
				Если Не ПустаяСтрока(ИдентификаторКартинки) Тогда
					// Это картинка.
					ЛегкаяПочтаКлиентСервер.ДобавитьКартинкуФайлНаДиске(
						СтруктураСообщения,
						ПолноеИмяВременногоФайла,
						FileName,
						ИдентификаторКартинки);
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			// Это обычное вложение.
			ЛегкаяПочтаКлиентСервер.ДобавитьВложениеФайлНаДиске(
				СтруктураСообщения,
				ПолноеИмяВременногоФайла,
				ИмяФайла,
				ИмяФайла);
			
		КонецЦикла;
		
		Результат.Добавить(СтруктураСообщения);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Открывает форму письма в программе MSOutlook
//
// Параметры:
// - Сообщение (Структура)
//
Функция ОткрытьФормуСообщенияMSOutlook(Сообщение) Экспорт
	
#Если МобильныйКлиент Тогда
	Возврат Ложь;
#Иначе
	Попытка
		Application = Новый COMОбъект("Outlook.Application");
	Исключение
		СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Возврат Ложь;
	КонецПопытки;
	
	MailItem = Application.CreateItem(0); // OlItemType.olMailItem
	
	Кому = "";
	Для каждого Получатель Из Сообщение.Получатели Цикл
		ДобавитьЗначениеКСтрокеЧерезРазделитель(Кому, "; ", Получатель);
	КонецЦикла;
	MailItem.To = Кому;
	
	Копия = "";
	Для каждого Получатель Из Сообщение.Копии Цикл
		ДобавитьЗначениеКСтрокеЧерезРазделитель(Копия, "; ", Получатель);
	КонецЦикла;
	MailItem.CC = Копия;
	
	СлепаяКопия = "";
	Для каждого Получатель Из Сообщение.СлепыеКопии Цикл
		ДобавитьЗначениеКСтрокеЧерезРазделитель(СлепаяКопия, "; ", Получатель);
	КонецЦикла;
	MailItem.BCC = СлепаяКопия;
	
	MailItem.Subject = Сообщение.Тема;
	MailItem.Body = Сообщение.Текст;
	
	ВременныйКаталог = ПоместитьВложенияВоВременныйКаталог(Сообщение);
	Если ПустаяСтрока(ВременныйКаталог) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Файлы = НайтиФайлы(ВременныйКаталог,"*.*");
	Для каждого Файл Из Файлы Цикл
		MailItem.Attachments.Add(Файл.ПолноеИмя, 1, 1, Файл.Имя); // OlAttachmentType.olByValue
	КонецЦикла;
	
	MailItem.Importance = ?(Сообщение.Важность = 2, 2, 1); // OlImportance.olImportanceHigh, OlImportance.olImportanceNormal
	
	Попытка
		Результат = Вычислить("MailItem.Display(Ложь)");
	Исключение
		// MSOutlook генерирует исключение при выполнении метода MailItem.Display, но карточку открывает.
	КонецПопытки;
	
	Возврат Истина;
#КонецЕсли
	
КонецФункции

// Удаляет сообщения с клиентской программы MSOutlook
//
// Параметры:
// - НастройкаЗагрузкиЭлектроннойПочты (Структура)
// - СерверныеИдентификаторыСообщений (Массив)
//   - Элемент (Строка)
//
Функция УдалитьСообщенияMSOutlook(
	НастройкаЗагрузкиЭлектроннойПочты,
	СерверныеИдентификаторыСообщений) Экспорт
	
#Если МобильныйКлиент Тогда
	Возврат Неопределено;
#Иначе
	Application = Новый COMОбъект("Outlook.Application");
	Для каждого СерверныйИдентификатор Из СерверныеИдентификаторыСообщений Цикл
		Item = Application.Session.GetItemFromID(СерверныйИдентификатор);
		Item.Delete();
	КонецЦикла;
	
	Возврат Истина;
#КонецЕсли
	
КонецФункции

// Помечает сообщения как прочтенные
//
// Параметры:
// - НастройкаЗагрузкиЭлектроннойПочты (Структура)
// - СерверныеИдентификаторыСообщений (Массив)
//   - Элемент (Строка)
//
Функция ПометитьКакПрочтенныеMSOutlook(
	ПараметрыЗагрузки,
	СерверныеИдентификаторыСообщений) Экспорт
	
#Если МобильныйКлиент Тогда
	Возврат Неопределено;
#Иначе
	Application = Новый COMОбъект("Outlook.Application");
	Для каждого СерверныйИдентификатор Из СерверныеИдентификаторыСообщений Цикл
		Попытка
			Item = Application.Session.GetItemFromID(СерверныйИдентификатор);
			Item.UnRead = 0;
		Исключение
			// Тут всегда возникает исключение, но действие выполняется правильно.
		КонецПопытки;
	КонецЦикла;
	
	Возврат Истина;
#КонецЕсли
	
КонецФункции

// Помечает сообщения как непрочтенные
//
// Параметры:
// - НастройкаЗагрузкиЭлектроннойПочты (Структура)
// - СерверныеИдентификаторыСообщений (Массив)
//   - Элемент (Строка)
//
Функция ПометитьКакНепрочтенныеMSOutlook(
	ПараметрыЗагрузки,
	СерверныеИдентификаторыСообщений) Экспорт
	
#Если МобильныйКлиент Тогда
	Возврат Неопределено;
#Иначе
	Application = Новый COMОбъект("Outlook.Application");
	Для каждого СерверныйИдентификатор Из СерверныеИдентификаторыСообщений Цикл
		Попытка             
			Item = Application.Session.GetItemFromID(СерверныйИдентификатор);
			Item.UnRead = 1;
		Исключение
			// Тут всегда возникает исключение, но действие выполняется правильно.
		КонецПопытки;
	КонецЦикла;
	
	Возврат Истина;
#КонецЕсли
	
КонецФункции

Функция ПолучитьПолноеИмяВременногоФайла(ИмяФайла) Экспорт
	
	Возврат ПолучитьИмяВременногоКаталога() + "\" + ИмяФайла;
	
КонецФункции

// Сохраняет вложения сообщения во временный каталог.
// Возвращает имя временного каталога. При ошибке вызывает исключение.
//
// Параметры:
// - Сообщение (Структура)
//
Функция ПоместитьВложенияВоВременныйКаталог(Сообщение) Экспорт
	
	ИмяВременногоКаталога = ПолучитьИмяВременногоКаталога();
	Если ПустаяСтрока(ИмяВременногоКаталога) Тогда
		Возврат "";
	КонецЕсли;
		
	Для каждого Вложение Из Сообщение.Вложения Цикл
		Значение = ПолучитьИзВременногоХранилища(Вложение.Адрес);
		Если Значение = Неопределено Тогда
			СообщениеОбОшибке = НСтр("ru = 'Не удалось получить файл. Возможно он был удален.'");
			Возврат "";
		КонецЕсли;
		Если ТипЗнч(Значение) = Тип("ДвоичныеДанные") Тогда
			ДвоичныеДанные = Значение;
		Иначе
			СообщениеОбОшибке = НСтр("ru = 'Не удалось получить файл. Возможно он был удален.'");
			Возврат "";
		КонецЕсли;
		
		ИмяФайла = Вложение.ИмяФайла;
		
		ИмяФайла = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ИмяФайла);
		ИмяФайла = СтрЗаменить(ИмяФайла, ",", " ");
		
		Если СтрДлина(ИмяФайла) > 50 Тогда
			
			МассивСтрок = СтрРазделить(ИмяФайла, ".", Ложь);
			Если МассивСтрок.Количество() >= 2 Тогда    
				
				Расширение = МассивСтрок[МассивСтрок.Количество() - 1];
				МассивСтрок.Удалить(МассивСтрок.Количество() - 1);
				Имя = СтрСоединить(МассивСтрок, ".");
				
				ИмяФайла = Лев(Имя, 46) + "." + Расширение;
				
			КонецЕсли;	
			
		КонецЕсли;	
		
		ПолноеИмяВременногоФайла = ИмяВременногоКаталога + "\" + ИмяФайла;
		Если ПустаяСтрока(ПолноеИмяВременногоФайла) Тогда
			Возврат "";
		КонецЕсли;
		
		ДвоичныеДанные.Записать(ПолноеИмяВременногоФайла);
	КонецЦикла;
	
	Возврат ИмяВременногоКаталога;
	
КонецФункции

// Сохраняет тело сообщение в файл "Содержание.txt" во временном каталоге.
// Возвращает полное имя файла.
//
// Параметры:
// - Сообщение (Структура)
//
Функция ПоместитьСодержаниеВоВременныйФайл(Сообщение) Экспорт
	
	ПолноеИмяВременногоФайла = ПолучитьПолноеИмяВременногоФайла("Содержание.txt");
#Если ВебКлиент Тогда
	ТекстовыйДокумент = Новый ТекстовыйДокумент();
	ТекстовыйДокумент.Вывести(Сообщение.Текст);
	ТекстовыйДокумент.Записать(ПолноеИмяВременногоФайла, "UTF-16");
#Иначе
	ЗаписьТекста = Новый ЗаписьТекста(ПолноеИмяВременногоФайла, КодировкаТекста.UTF16);
	ЗаписьТекста.Записать(Сообщение.Текст);
	ЗаписьТекста.Закрыть();
#КонецЕсли
	Возврат ПолноеИмяВременногоФайла;
	
КонецФункции

// Удаляет сообщения с сервера
//
// Параметры:
// - НастройкаЗагрузкиЭлектроннойПочты (Структура)
// - СерверныеИдентификаторыСообщений (Массив) Элемент (Строка)
// 
Функция УдалитьСообщения(НастройкаЗагрузкиЭлектроннойПочты, СерверныеИдентификаторыСообщений) Экспорт
	
	Профиль = НастройкаЗагрузкиЭлектроннойПочты.НастройкиПрофилейДляЗагрузки.Профиль.Профиль;
	
	Если ТипЗнч(Профиль) = Тип("СправочникСсылка.УчетныеЗаписиЭлектроннойПочты") Тогда
		ВидПочтовогоКлиента = ПредопределенноеЗначение("Перечисление.ВидыПочтовыхКлиентов.ИнтернетПочта");
	Иначе
		ДанныеПрофиля = ЛегкаяПочтаКлиентСервер.ПолучитьПрофильДляЗагрузки(Профиль);
		ВидПочтовогоКлиента = ДанныеПрофиля.ВидПочтовогоКлиента;
	КонецЕсли;
	
	Если ВидПочтовогоКлиента = ПредопределенноеЗначение("Перечисление.ВидыПочтовыхКлиентов.ИнтернетПочта") Тогда
		УчетнаяЗапись = НастройкаЗагрузкиЭлектроннойПочты.НастройкиПрофилейДляЗагрузки.Профиль.Профиль;
		Пароль = НастройкаЗагрузкиЭлектроннойПочты.НастройкиПрофилейДляЗагрузки.Профиль.Пароль;
		Если ПустаяСтрока(Пароль) И Не НастройкаЗагрузкиЭлектроннойПочты.ПарольНеТребуется Тогда
			Пароль = НастройкаЗагрузкиЭлектроннойПочты.ПарольУчетнойЗаписиПочты;
		КонецЕсли;
		
		Результат = ЛегкаяПочтаСервер.УдалитьСообщенияИнтернетПочта(
			УчетнаяЗапись,
			Пароль,
			СерверныеИдентификаторыСообщений);
		
	ИначеЕсли ВидПочтовогоКлиента = ПредопределенноеЗначение("Перечисление.ВидыПочтовыхКлиентов.Почта") Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Нет возможности удалять сообщения на сервере с помощью клиента Почта.'"));
		Результат = Ложь;
	ИначеЕсли ВидПочтовогоКлиента = ПредопределенноеЗначение("Перечисление.ВидыПочтовыхКлиентов.MSOutlook") Тогда
		Результат = ЛегкаяПочтаКлиент.УдалитьСообщенияMSOutlook(
			НастройкаЗагрузкиЭлектроннойПочты,
			СерверныеИдентификаторыСообщений);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Помечает письма как прочтенные
//
Функция ПометитьКакПрочтенные(НастройкаЗагрузкиЭлектроннойПочты, СерверныеИдентификаторыСообщений) Экспорт
	
	Профиль = НастройкаЗагрузкиЭлектроннойПочты.НастройкиПрофилейДляЗагрузки.Профиль.Профиль;
	
	Если ТипЗнч(Профиль) = Тип("СправочникСсылка.УчетныеЗаписиЭлектроннойПочты") Тогда
		ВидПочтовогоКлиента = ПредопределенноеЗначение("Перечисление.ВидыПочтовыхКлиентов.ИнтернетПочта");
	Иначе
		ДанныеПрофиля = ЛегкаяПочтаКлиентСервер.ПолучитьПрофильДляЗагрузки(Профиль);
		ВидПочтовогоКлиента = ДанныеПрофиля.ВидПочтовогоКлиента;
	КонецЕсли;
	
	Если ВидПочтовогоКлиента = ПредопределенноеЗначение("Перечисление.ВидыПочтовыхКлиентов.ИнтернетПочта") Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Сервис недоступен.'"));
		Результат = Ложь;
	ИначеЕсли ВидПочтовогоКлиента = ПредопределенноеЗначение("Перечисление.ВидыПочтовыхКлиентов.Почта") Тогда
		
		Если ОбщегоНазначенияКлиент.ЭтоWindowsКлиент() Тогда
			Результат = ЛегкаяПочтаКлиентWindows.ПометитьКакПрочтенныеПочта(
				НастройкаЗагрузкиЭлектроннойПочты,
				СерверныеИдентификаторыСообщений);
		КонецЕсли;	
			
	ИначеЕсли ВидПочтовогоКлиента = ПредопределенноеЗначение("Перечисление.ВидыПочтовыхКлиентов.MSOutlook") Тогда
		Результат = ЛегкаяПочтаКлиент.ПометитьКакПрочтенныеMSOutlook(
			НастройкаЗагрузкиЭлектроннойПочты,
			СерверныеИдентификаторыСообщений);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Помечает письма как непрочтенные
//
Функция ПометитьКакНепрочтенные(НастройкаЗагрузкиЭлектроннойПочты, СерверныеИдентификаторыСообщений) Экспорт
	
	Профиль = НастройкаЗагрузкиЭлектроннойПочты.НастройкиПрофилейДляЗагрузки.Профиль.Профиль;
	
	Если ТипЗнч(Профиль) = Тип("СправочникСсылка.УчетныеЗаписиЭлектроннойПочты") Тогда
		ВидПочтовогоКлиента = ПредопределенноеЗначение("Перечисление.ВидыПочтовыхКлиентов.ИнтернетПочта");
	Иначе
		ДанныеПрофиля = ЛегкаяПочтаКлиентСервер.ПолучитьПрофильДляЗагрузки(Профиль);
		ВидПочтовогоКлиента = ДанныеПрофиля.ВидПочтовогоКлиента;
	КонецЕсли;
	
	Если ВидПочтовогоКлиента = ПредопределенноеЗначение("Перечисление.ВидыПочтовыхКлиентов.ИнтернетПочта") Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Сервис недоступен.'"));
		Результат = Ложь;
	ИначеЕсли ВидПочтовогоКлиента = ПредопределенноеЗначение("Перечисление.ВидыПочтовыхКлиентов.Почта") Тогда
		
		Если ОбщегоНазначенияКлиент.ЭтоWindowsКлиент() Тогда
			Результат = ЛегкаяПочтаКлиентWindows.ПометитьКакНепрочтенныеПочта(
				НастройкаЗагрузкиЭлектроннойПочты,
				СерверныеИдентификаторыСообщений);
		КонецЕсли;	
			
	ИначеЕсли ВидПочтовогоКлиента = ПредопределенноеЗначение("Перечисление.ВидыПочтовыхКлиентов.MSOutlook") Тогда
		Результат = ЛегкаяПочтаКлиент.ПометитьКакНепрочтенныеMSOutlook(
			НастройкаЗагрузкиЭлектроннойПочты,
			СерверныеИдентификаторыСообщений);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Открывает форму редактирования профиля в зависимости от вида почтового клиента
//
// Параметры:
// - Профиль (Строка, СправочникСсылка.УчетныеЗаписиЭлектроннойПочты)
// - УникальныйИдентификатор (УникальныйИдентификатор)
//
Процедура РедактироватьПрофильОтправки(Профиль, УникальныйИдентификатор, ОписаниеОповещения) Экспорт
	
	Если Профиль.ВидПочтовогоКлиента = ПредопределенноеЗначение("Перечисление.ВидыПочтовыхКлиентов.Почта") Тогда
		ОткрытьФорму(
			"Обработка.НастройкаПочты.Форма.ОтправкаПочта",
			Профиль,
			УникальныйИдентификатор,,,,
			ОписаниеОповещения,
			РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	ИначеЕсли Профиль.ВидПочтовогоКлиента = ПредопределенноеЗначение("Перечисление.ВидыПочтовыхКлиентов.MSOutlook") Тогда
		ОткрытьФорму(
			"Обработка.НастройкаПочты.Форма.ОтправкаMSOutlook",
			Профиль,
			УникальныйИдентификатор,,,,
			ОписаниеОповещения,
			РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	ИначеЕсли Профиль.ВидПочтовогоКлиента = ПредопределенноеЗначение("Перечисление.ВидыПочтовыхКлиентов.TheBat") Тогда
		ОткрытьФорму(
			"Обработка.НастройкаПочты.Форма.ОтправкаTheBat",
			Профиль,
			УникальныйИдентификатор,,,,
			ОписаниеОповещения,
			РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	ИначеЕсли Профиль.ВидПочтовогоКлиента = ПредопределенноеЗначение("Перечисление.ВидыПочтовыхКлиентов.MozillaThunderbird") Тогда	
		ОткрытьФорму(
			"Обработка.НастройкаПочты.Форма.ОтправкаMozillaThunderbird",
			Профиль,
			УникальныйИдентификатор,,,,
			ОписаниеОповещения,
			РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	Иначе
		ВызватьИсключение "";
	КонецЕсли;
	
КонецПроцедуры

// Открывает форму редактирования профиля в зависимости от вида почтового клиента
//
// Параметры:
// - Профиль (Строка, СправочникСсылка.УчетныеЗаписиЭлектроннойПочты)
// - УникальныйИдентификатор (УникальныйИдентификатор)
//
Процедура РедактироватьПрофильЗагрузки(Профиль, УникальныйИдентификатор, ОписаниеОповещения) Экспорт
	
	Если Профиль.ВидПочтовогоКлиента = ПредопределенноеЗначение("Перечисление.ВидыПочтовыхКлиентов.Почта") Тогда
		ОткрытьФорму(
			"Обработка.НастройкаПочты.Форма.ЗагрузкаПочта",
			Профиль,
			УникальныйИдентификатор,,,,
			ОписаниеОповещения,
			РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	ИначеЕсли Профиль.ВидПочтовогоКлиента = ПредопределенноеЗначение("Перечисление.ВидыПочтовыхКлиентов.MSOutlook") Тогда
			
		#Если НЕ ВебКлиент Тогда			
		ОткрытьФорму(
			"Обработка.НастройкаПочты.Форма.ЗагрузкаMSOutlook",
			Профиль,
			УникальныйИдентификатор,,,,
			ОписаниеОповещения,
			РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		#Иначе
			ПоказатьПредупреждение(, НСтр("ru = 'В веб клиенте загрузка из Microsoft Outlook не поддерживается.'"));
		#КонецЕсли	
	Иначе
		ВызватьИсключение НСтр("ru = 'Не указан вид почтового клиента.'");
	КонецЕсли;
	
КонецПроцедуры

// Возвращает признак того что профиль относится к внешнему почтовому клиенту
//
// Параметры:
//
// СтруктураПрофиля (Структура)
// - ВидПочтовогоКлиента (ПеречислениеСсылка.ВидыПочтовыхКлиентов)
//
Функция ЭтоПрофильВнешнегоПочтовогоКлиента(СтруктураПрофиля) Экспорт
	
	Если Не ЗначениеЗаполнено(СтруктураПрофиля) Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат (СтруктураПрофиля.ВидПочтовогоКлиента = ПредопределенноеЗначение("Перечисление.ВидыПочтовыхКлиентов.MSOutlook")
		Или СтруктураПрофиля.ВидПочтовогоКлиента = ПредопределенноеЗначение("Перечисление.ВидыПочтовыхКлиентов.TheBat")
		Или СтруктураПрофиля.ВидПочтовогоКлиента = ПредопределенноеЗначение("Перечисление.ВидыПочтовыхКлиентов.MozillaThunderbird"));
		
КонецФункции

// Возвращает признак того что профиль относится к внутреннему почтовому клиенту
//
// Параметры:
//
// СтруктураПрофиля (Структура)
// - ВидПочтовогоКлиента (ПеречислениеСсылка.ВидыПочтовыхКлиентов)
//
Функция ЭтоПрофильВнутреннегоПочтовогоКлиента(СтруктураПрофиля) Экспорт
	
	Если Не ЗначениеЗаполнено(СтруктураПрофиля) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат СтруктураПрофиля.ВидПочтовогоКлиента = ПредопределенноеЗначение("Перечисление.ВидыПочтовыхКлиентов.ИнтернетПочта")
		Или СтруктураПрофиля.ВидПочтовогоКлиента = ПредопределенноеЗначение("Перечисление.ВидыПочтовыхКлиентов.Почта");

КонецФункции

// Обработка команды "Создать на основании - Письмо".
//
Процедура СоздатьПисьмоНаОсновании(Ссылка) Экспорт
	
	Если ДелопроизводствоКлиентСервер.ЭтоДокумент(Ссылка) Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения(
			"СоздатьПисьмоНаОснованииПроверитьНаличиеЗанятыхФайлов",
			ЭтотОбъект);

		ПроверитьНаличиеЗанятыхФайлов(Ссылка, ОписаниеОповещения);
		
		Возврат;
		
	КонецЕсли;	
	
	СоздатьПисьмоНаОснованииПродолжение(Ссылка);
	
КонецПроцедуры

Процедура СоздатьПисьмоНаОснованииПроверитьНаличиеЗанятыхФайлов(Результат, Параметры) Экспорт 

	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	СоздатьПисьмоНаОснованииПродолжение(Параметры.Ссылка);

КонецПроцедуры

Функция ПроверитьНаличиеЗанятыхФайлов(Объект, ОписаниеОповещенияИсходное) Экспорт
	
	ТекущийПользователь = ФайловыеФункцииКлиентПовтИсп.ПолучитьПерсональныеНастройкиРаботыСФайлами().ТекущийПользователь;
	
	ПараметрыОбработчикаОповещения = Новый Структура;
	ПараметрыОбработчикаОповещения.Вставить("ОписаниеОповещения", ОписаниеОповещенияИсходное);
	ПараметрыОбработчикаОповещения.Вставить("Ссылка", Объект);    
	ПараметрыОбработчикаОповещения.Вставить("КоличествоЗанятыхФайлов", 0);
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ВопросОВыполненииПриЗанятыхФайлах", 
		ЭтотОбъект,
		ПараметрыОбработчикаОповещения);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СообщениеВопрос", НСтр("ru = 'Создать письмо?'"));
	ПараметрыФормы.Вставить("СообщениеЗаголовок", НСтр("ru = 'Некоторые файлы документа заняты для редактирования:'"));
	ПараметрыФормы.Вставить("Заголовок", НСтр("ru = 'Создание письма'"));
	ПараметрыФормы.Вставить("ТекстКнопкиЗакончитьИЗакрыть", НСтр("ru = 'Закончить редактирование и создать'"));
	ПараметрыФормы.Вставить("ТекстКнопкиЗакрыть", НСтр("ru = 'Создать'"));
	ПараметрыФормы.Вставить("ВладелецФайла", Объект);

	ФиксированныйМассивВсеСотрудникиТекущегоПользователя =
		СотрудникиКлиент.ВсеСотрудникиТекущегоПользователя();
	МассивВсеСотрудникиТекущегоПользователя = Новый Массив(
		ФиксированныйМассивВсеСотрудникиТекущегоПользователя);
	СотрудникиТекущегоПользователя = Новый СписокЗначений();
	СотрудникиТекущегоПользователя.ЗагрузитьЗначения(МассивВсеСотрудникиТекущегоПользователя);
	ПараметрыФормы.Вставить("СотрудникиТекущегоПользователя", СотрудникиТекущегоПользователя);
	
	ТекущийПользователь = ФайловыеФункцииКлиентПовтИсп.ПолучитьПерсональныеНастройкиРаботыСФайлами().ТекущийПользователь;
	ПараметрыФормы.Вставить("ТекущийПользователь", ТекущийПользователь);
	
	РаботаСФайламиКлиент.ОткрытьДиалогСписокЗанятыхФайлов(ПараметрыФормы, ОписаниеОповещения);
	
	ПараметрыОбработчикаОповещения.Вставить("КоличествоЗанятыхФайлов", ПараметрыФормы.КоличествоЗанятыхФайлов);
	
	Если ПараметрыФормы.КоличествоЗанятыхФайлов = 0 Тогда
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, КодВозвратаДиалога.Да);
	КонецЕсли;
		
КонецФункции

Процедура ВопросОВыполненииПриЗанятыхФайлах(Результат, Параметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда 
		ВыполнитьОбработкуОповещения(Параметры.ОписаниеОповещения, Результат);
		Возврат;
	КонецЕсли;
	
	СоздатьПисьмоНаОснованииПродолжение(Параметры.Ссылка);
	
КонецПроцедуры

// Обработка команды "Создать на основании - Письмо".
//
Процедура СоздатьПисьмоНаОснованииПродолжение(Ссылка) Экспорт
	
	Объекты = Новый Массив;
	Объекты.Добавить(Ссылка);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Объекты", Объекты);
	ОткрытьФорму(
		"Обработка.ПочтовоеСообщение.Форма.Форма",
		ПараметрыОткрытия,,
		Новый УникальныйИдентификатор);
			
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НайтиИдентификаторКартинки(ИдентификаторыКартинокHTML, ИмяФайла)
	
	Для каждого ИдентификаторКартинки Из ИдентификаторыКартинокHTML Цикл
		Если Найти(ИдентификаторКартинки, "cid:" + ИмяФайла + "@") > 0 Тогда
			Возврат ИдентификаторКартинки;
		КонецЕсли;
	КонецЦикла;
	Возврат "";
	
КонецФункции

Функция ПолучитьИдентификаторыКартинок(ТекстHTML)
	
	Результат = Новый Массив;
	
#Если Не ВебКлиент Тогда
	Построитель = Новый ПостроительDOM;
	ЧтениеHTML = Новый ЧтениеHTML;
	ЧтениеHTML.УстановитьСтроку(ТекстHTML);
	ДокументHTML = Построитель.Прочитать(ЧтениеHTML);
	Для каждого Картинка Из ДокументHTML.Картинки Цикл
		Результат.Добавить(Картинка.Источник);
	КонецЦикла;
#КонецЕсли
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьСтрокуПолучателейMSOutlook(Recipients)
	
	Результат = "";
	Для каждого Recipient Из Recipients Цикл
		Если ПустаяСтрока(Recipient.Name) Тогда
			ДобавитьЗначениеКСтрокеЧерезРазделитель(Результат, "; ", Recipient.Address);
		Иначе
			ДобавитьЗначениеКСтрокеЧерезРазделитель(Результат, "; ", Recipient.Name + " <" + Recipient.Address + ">");
		КонецЕсли;
	КонецЦикла;
	Возврат РаботаСоСтроками.УдалитьНедопустимыеСимволыXML(Результат);
	
КонецФункции

Функция ПолучитьИмяВременногоКаталога()
	
	#Если ВебКлиент Тогда
		Возврат "";
	#Иначе
		ИмяВременногоКаталога = ПолучитьИмяВременногоФайла("");
		СоздатьКаталог(ИмяВременногоКаталога);
		Возврат ИмяВременногоКаталога;
	#КонецЕсли
	
КонецФункции

#КонецОбласти
